Tekla Open API Reference for Tekla Structures 2025
AnalysisObjectEnumerator.CurrentSelected Property
 Gets or sets the currently selected item.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisObject CurrentSelected { get; set; }
Public Property CurrentSelected As AnalysisObject
	Get
	Set
Property Value
Type: AnalysisObject
See Also
Reference
AnalysisObjectEnumerator Class
Tekla.Structures.Analysis Namespace